
# certutil -addstore -f -Hamham ROOT CertificateFileName.der
title: Root Certificate Installed
id: 46591fae-7a4c-46ea-aec3-dff5e6d785dc
status: experimental
description: Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1553.004/T1553.004.md
    - https://superuser.com/questions/1506440/import-certificates-using-command-line-on-windows
    - https://docs.microsoft.com/en-us/windows-hardware/drivers/install/using-certmgr-to-install-test-certificates-on-a-test-computer
author: Mohamed Hamham
date: 2022/06/02
tags:
    - attack.defense_evasion
    - attack.t1553.004
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        NewProcessName|endswith: '\certutil.exe'     # Example: certutil -addstore -f -user ROOT CertificateFileName.der
        CommandLine|contains|all: 
            - '-addstore'
            - 'root'
    selection2:
        NewProcessName|endswith: '\CertMgr.exe'      # Example: CertMgr.exe /add CertificateFileName.cer /s /r localMachine root /all
        CommandLine|contains|all:
            - '/add'
            - 'root'
    condition: selection1 or selection2
level: medium
falsepositives:
    - Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to test if GPO push doesn't trigger FP