# Verified 
# certutil.exe -urlcache -split -f http://7-zip.org/a/7z1604-x64.exe 7zip.exe
# certutil -encode Test.txt Output.txt

title: Suspicious Certutil Command
id: e011a729-98a6-4139-b5c4-bf6f6dd8239a
status: experimental
description: Detects a suspicious Microsoft certutil execution with sub commands like 'decode' sub command, which is sometimes used to decode malicious code with
    the built-in certutil utility
author: Mohamed Hamham
date: 2022/06/02
tags:
    - attack.defense_evasion
    - attack.t1140
    - attack.command_and_control
references:
    - https://twitter.com/egre55/status/1087685529016193025
    - https://lolbas-project.github.io/lolbas/Binaries/Certutil/
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
logsource:
    category: process_creation
    product: windows
detection:
    Selection1:
        NewProcessName|endswith: '\certutil.exe'
        CommandLine|contains:
            - ' -decode '
            - ' -decodehex '
            - ' -urlcache '
            - ' -verifyctl '
            - ' -encode '
            - ' -split '
            - ' /decode '
            - ' /decodehex '
            - ' /urlcache '
            - ' /verifyctl '
            - ' /encode '
            - ' /split ' 
    Selection2:
        NewProcessName|endswith: '\certutil.exe'
        CommandLine|contains:
            - 'URL'
            - 'ping'
    condition: Selection1 or Selection2
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment
level: high